In [6]:
import pandas as pd

In [7]:
df = pd.read_excel(r"C:\Users\user\Downloads\Customer Call List (2).xlsx")
df.head()

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Not_Useful_Column
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,True
1,1002,Abed,Nadir,123/643/9775,93 West Main Street,No,Yes,False
2,1003,Walter,/White,7066950392,298 Drugs Driveway,N,NaN,True
3,1004,Dwight,Schrute,123-543-2345,"980 Paper Avenue, Pennsylvania, 18503",Yes,Y,True
4,1005,Jon,Snow,876|678|3469,123 Dragons Road,Y,No,True

In [8]:
df.tail()

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Not_Useful_Column
16,1017,Michael,Scott,123/643/9775,"121 Paper Avenue, Pennsylvania",Yes,No,False
17,1018,Clark,Kent,7066950392,3498 Super Lane,Y,NaN,True
18,1019,Creed,Braton,N/a,N/a,N/a,Yes,True
19,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N,True
20,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N,True

In [9]:
df = df.drop_duplicates()
df = df.drop(columns="Not_Useful_Column")

In [12]:
df["Last_Name"] = df["Last_Name"].astype(str).str.strip("./_ ")
df.head()

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No
1,1002,Abed,Nadir,123/643/9775,93 West Main Street,No,Yes
2,1003,Walter,White,7066950392,298 Drugs Driveway,N,NaN
3,1004,Dwight,Schrute,123-543-2345,"980 Paper Avenue, Pennsylvania, 18503",Yes,Y
4,1005,Jon,Snow,876|678|3469,123 Dragons Road,Y,No

In [13]:
df["Phone_Number"] = (
    df["Phone_Number"]
    .astype(str)
    .str.replace(r'[^0-9]', '', regex=True)
)

def format_phone(number):
    if len(number) == 10:
        return number
    else:
        return ""

df["Phone_Number"] = df["Phone_Number"].apply(format_phone)

In [19]:
mapping = {
    "Yes": "Yes",
    "Y": "Yes",
    "No": "No",
    "N": "No"
}

df["Paying Customer"] = df["Paying Customer"].replace(mapping)
df["Do_Not_Contact"] = df["Do_Not_Contact"].replace(mapping)

In [15]:
df["Do_Not_Contact"] = df["Do_Not_Contact"].fillna("No")

In [16]:
df = df.replace(["N/a", "NaN"], "")
df = df.fillna("")

In [17]:
df = df[df["Do_Not_Contact"] != "Yes"]
df = df[df["Phone_Number"] != ""]

In [18]:
df = df.reset_index(drop=True)

print(df)

    CustomerID First_Name   Last_Name Phone_Number  \
0         1001      Frodo     Baggins   1235455421
1         1003     Walter       White   7066950392
2         1004     Dwight     Schrute   1235432345
3         1005        Jon        Snow   8766783469
4         1008   Sherlock      Holmes   8766783469
5         1010      Peter      Parker   1235455421
6         1012      Harry      Potter   7066950392
7         1013        Don      Draper   1235432345
8         1014     Leslie       Knope   8766783469
9         1015       Toby  Flenderson   3047622467
10        1016        Ron     Weasley   1235455421
11        1017   Michael        Scott   1236439775
12        1018      Clark        Kent   7066950392
13        1020     Anakin   Skywalker   8766783469

                                  Address Paying Customer Do_Not_Contact
0                   123 Shire Lane, Shire             Yes             No
1                      298 Drugs Driveway               N             No
2   980 Paper Avenue, Pennsylvania, 18503             Yes              Y
3                        123 Dragons Road               Y             No
4                           98 Clue Drive               N             No
5              25th Main Street, New York             Yes             No
6                    2394 Hogwarts Avenue               Y             No
7                        2039 Main Street             Yes              N
8                        343 City Parkway             Yes             No
9                           214 HR Avenue               N             No
10                   2395 Hogwarts Avenue              No              N
11         121 Paper Avenue, Pennsylvania             Yes             No
12                        3498 Super Lane               Y             No
13            910 Tatooine Road, Tatooine             Yes              N